Revit 2027 API
RebarHostData.GetAreaReinforcementsInHost Method
 Returns all AreaReinforcement elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<AreaReinforcement> GetAreaReinforcementsInHost()
Public Function GetAreaReinforcementsInHost As IList(Of AreaReinforcement)
public:
IList<AreaReinforcement^>^ GetAreaReinforcementsInHost()
member GetAreaReinforcementsInHost : unit -> IList<AreaReinforcement>
Return Value
IList<AreaReinforcement>
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace